Gets the coordinate points of the polyline.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public IList<XYZ> GetCoordinates()
  Visual Basic
Public Function GetCoordinates As IList(Of XYZ)
  Visual C++
public:
IList<XYZ^>^ GetCoordinates()
 See Also
  PolyLine Class
  Autodesk.Revit.DB Namespace